uam_crosswind_validation/experimental_validation/cfd_analysis/uam_crosswind_cfd/0/omega
/*--------------------------------*- C++ -*----------------------------------*\
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    object      omega;
}

// 비소산율 경계조건

dimensions      [0 0 -1 0 0 0 0];

internalField   uniform 6.990;

boundaryField
{
    inlet
    {
        type            fixedValue;
        value           uniform 6.990;
    }
    
    outlet
    {
        type            zeroGradient;
    }
    
    sides
    {
        type            symmetryPlane;
    }
    
    top
    {
        type            symmetryPlane;
    }
    
    bottom
    {
        type            omegaWallFunction;
        value           uniform 6.990;
    }
    
    uam
    {
        type            omegaWallFunction;
        value           uniform 6.990;
    }
}
