uam_crosswind_validation/experimental_validation/cfd_analysis/uam_crosswind_cfd/0/p
/*--------------------------------*- C++ -*----------------------------------*\
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    object      p;
}

// 압력 경계조건

dimensions      [0 2 -2 0 0 0 0];

internalField   uniform 0;

boundaryField
{
    inlet
    {
        type            zeroGradient;
    }
    
    outlet
    {
        type            fixedValue;
        value           uniform 0;
    }
    
    sides
    {
        type            symmetryPlane;
    }
    
    top
    {
        type            symmetryPlane;
    }
    
    bottom
    {
        type            zeroGradient;
    }
    
    uam
    {
        type            zeroGradient;
    }
}
