uam_crosswind_validation/experimental_validation/cfd_analysis/uam_crosswind_cfd/constant/transportProperties
/*--------------------------------*- C++ -*----------------------------------*\
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      transportProperties;
}

// 유체 물성치

transportModel  Newtonian;

nu              [0.000014776];
