uam_crosswind_validation/experimental_validation/cfd_analysis/uam_crosswind_cfd/constant/turbulenceProperties
/*--------------------------------*- C++ -*----------------------------------*\
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      turbulenceProperties;
}

// 난류 모델 설정

simulationType  RAS;

RAS
{
    RASModel        kOmegaSST;
    
    turbulence      on;
    
    printCoeffs     on;
}
